{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import os\n",
    "import re"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "def replace_non_letters_with_space(text):\n",
    "  text = re.sub(r\"[^a-zA-Z]\", \" \", text)\n",
    "  return text"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "## Handles a folder like Cognitive/Abilities/file.csv\n",
    "def create_combined_csv_from_a_multi_folder_folder(path_to_general_folder, category_type):\n",
    "  # Go to the general folder \"Cognitive Abilities and get the CA's categories\"\n",
    "  categories = os.listdir(path_to_general_folder)\n",
    "  print(categories)\n",
    "\n",
    "  # main_df will carry all the csvs\n",
    "  main_df = pd.DataFrame()\n",
    "\n",
    "  # Go from general folder to the categories\n",
    "  for category in categories:\n",
    "    path_to_csvs = path_to_general_folder + f\"\\{category}\"\n",
    "    csvs = os.listdir(path_to_csvs)\n",
    "\n",
    "    # Go from categories to get the csvs\n",
    "    for csv in csvs:\n",
    "      path_to_csv = f\"{path_to_csvs}\\{csv}\"\n",
    "      \n",
    "      # read_csv, add 2 column 'Ability' and 'Category, and concatenate the csv with the main_csv which containes all the abilities and their categories\n",
    "      df = pd.read_csv(path_to_csv)\n",
    "      ability_name = csv[:-4]\n",
    "      df[category_type] = replace_non_letters_with_space(ability_name)\n",
    "      df[\"Category\"] = category\n",
    "      main_df = pd.concat([df, main_df], ignore_index=True)\n",
    "\n",
    "  print(f\"main_df contains:\")\n",
    "  print(f\"{len(list(main_df['Occupation'].unique()))} unique occupations\")\n",
    "  print(f\"{len(list(main_df['Category'].unique()))} unique categories\")\n",
    "  print(f\"{len(list(main_df[category_type].unique()))} unique {category_type}s\")\n",
    "  \n",
    "  return main_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "## Handles a folder like Abilities/file.csv\n",
    "def create_combined_csv_from_a_non_multi_folder_folder(path_to_general_folder, category_name, category_type):\n",
    "  \n",
    "  # Go to the general folder \"Cognitive Abilities and get the CA's categories\"\n",
    "  csvs = os.listdir(path_to_general_folder)\n",
    "  print(csvs)\n",
    "\n",
    "  # main_df will carry all the csvs\n",
    "  main_df = pd.DataFrame()\n",
    "\n",
    "  # Go from categories to get the csvs\n",
    "  for csv in csvs:\n",
    "    path_to_csv = f\"{path_to_general_folder}\\{csv}\"\n",
    "    \n",
    "    # read_csv, add 2 column 'Ability' and 'Category, and concatenate the csv with the main_csv which containes all the abilities and their categories\n",
    "    df = pd.read_csv(path_to_csv)\n",
    "    ability_name = csv[:-4]\n",
    "    df[category_type] = replace_non_letters_with_space(ability_name)\n",
    "    df[\"Category\"] = category_name\n",
    "    main_df = pd.concat([df, main_df], ignore_index=True)\n",
    "\n",
    "  print(f\"main_df contains:\")\n",
    "  print(f\"{len(list(main_df['Occupation'].unique()))} unique occupations\")\n",
    "  print(f\"{len(list(main_df['Category'].unique()))} unique categories\")\n",
    "  print(f\"{len(list(main_df[category_type].unique()))} unique {category_type}s\")\n",
    "  \n",
    "  return main_df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Text to Personality"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Text</th>\n",
       "      <th>Extraversion</th>\n",
       "      <th>Neuroticism</th>\n",
       "      <th>Agreeableness</th>\n",
       "      <th>Conscientiousness</th>\n",
       "      <th>Openness</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>I just got back from your class, so I decided ...</td>\n",
       "      <td>n</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>It is 9:35 and I am beginning my stream of con...</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Not only was the server down but it has taken ...</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>I am not exactly sure how this is supposed to ...</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>n</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Well, here I am on Friday, September something...</td>\n",
       "      <td>n</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>n</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12379</th>\n",
       "      <td>little things give you away.</td>\n",
       "      <td>n</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12380</th>\n",
       "      <td>is wishing it was Saturday.</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12381</th>\n",
       "      <td>is studying hard for the G.R.E.</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12382</th>\n",
       "      <td>snipers get more head</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12383</th>\n",
       "      <td>Last night was amazing! Not only did I see *PR...</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>12384 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                    Text Extraversion  \\\n",
       "0      I just got back from your class, so I decided ...            n   \n",
       "1      It is 9:35 and I am beginning my stream of con...            y   \n",
       "2      Not only was the server down but it has taken ...            y   \n",
       "3      I am not exactly sure how this is supposed to ...            y   \n",
       "4      Well, here I am on Friday, September something...            n   \n",
       "...                                                  ...          ...   \n",
       "12379                       little things give you away.            n   \n",
       "12380                        is wishing it was Saturday.            y   \n",
       "12381                    is studying hard for the G.R.E.            y   \n",
       "12382                              snipers get more head            n   \n",
       "12383  Last night was amazing! Not only did I see *PR...            y   \n",
       "\n",
       "      Neuroticism Agreeableness Conscientiousness Openness  \n",
       "0               n             y                 y        n  \n",
       "1               n             y                 n        y  \n",
       "2               n             y                 y        y  \n",
       "3               n             y                 n        n  \n",
       "4               n             y                 n        n  \n",
       "...           ...           ...               ...      ...  \n",
       "12379           n             y                 n        y  \n",
       "12380           y             y                 y        y  \n",
       "12381           y             y                 y        y  \n",
       "12382           y             n                 n        y  \n",
       "12383           y             n                 y        y  \n",
       "\n",
       "[12384 rows x 6 columns]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df = pd.read_csv(\"../Datasets/Personality Traits/Text to Personality Trait/Essays_with_MyPersonality.csv\",  encoding='ISO-8859-1')\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>STATUS</th>\n",
       "      <th>sEXT</th>\n",
       "      <th>sNEU</th>\n",
       "      <th>sAGR</th>\n",
       "      <th>sCON</th>\n",
       "      <th>sOPN</th>\n",
       "      <th>cEXT</th>\n",
       "      <th>cNEU</th>\n",
       "      <th>cAGR</th>\n",
       "      <th>cCON</th>\n",
       "      <th>cOPN</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>likes the sound of thunder.</td>\n",
       "      <td>2.65</td>\n",
       "      <td>3.00</td>\n",
       "      <td>3.15</td>\n",
       "      <td>3.25</td>\n",
       "      <td>4.40</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>is so sleepy it's not even funny that's she ca...</td>\n",
       "      <td>2.65</td>\n",
       "      <td>3.00</td>\n",
       "      <td>3.15</td>\n",
       "      <td>3.25</td>\n",
       "      <td>4.40</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>is sore and wants the knot of muscles at the b...</td>\n",
       "      <td>2.65</td>\n",
       "      <td>3.00</td>\n",
       "      <td>3.15</td>\n",
       "      <td>3.25</td>\n",
       "      <td>4.40</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>likes how the day sounds in this new song.</td>\n",
       "      <td>2.65</td>\n",
       "      <td>3.00</td>\n",
       "      <td>3.15</td>\n",
       "      <td>3.25</td>\n",
       "      <td>4.40</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>is home. &lt;3</td>\n",
       "      <td>2.65</td>\n",
       "      <td>3.00</td>\n",
       "      <td>3.15</td>\n",
       "      <td>3.25</td>\n",
       "      <td>4.40</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9912</th>\n",
       "      <td>little things give you away.</td>\n",
       "      <td>2.15</td>\n",
       "      <td>2.15</td>\n",
       "      <td>4.10</td>\n",
       "      <td>2.90</td>\n",
       "      <td>4.60</td>\n",
       "      <td>n</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9913</th>\n",
       "      <td>is wishing it was Saturday.</td>\n",
       "      <td>4.05</td>\n",
       "      <td>3.35</td>\n",
       "      <td>3.80</td>\n",
       "      <td>3.95</td>\n",
       "      <td>4.50</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9914</th>\n",
       "      <td>is studying hard for the G.R.E.</td>\n",
       "      <td>4.05</td>\n",
       "      <td>3.35</td>\n",
       "      <td>3.80</td>\n",
       "      <td>3.95</td>\n",
       "      <td>4.50</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9915</th>\n",
       "      <td>snipers get more head</td>\n",
       "      <td>1.40</td>\n",
       "      <td>4.05</td>\n",
       "      <td>3.30</td>\n",
       "      <td>3.40</td>\n",
       "      <td>3.95</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9916</th>\n",
       "      <td>Last night was amazing! Not only did I see *PR...</td>\n",
       "      <td>4.25</td>\n",
       "      <td>3.00</td>\n",
       "      <td>3.25</td>\n",
       "      <td>3.50</td>\n",
       "      <td>4.00</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>9917 rows × 11 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                 STATUS  sEXT  sNEU  sAGR  \\\n",
       "0                           likes the sound of thunder.  2.65  3.00  3.15   \n",
       "1     is so sleepy it's not even funny that's she ca...  2.65  3.00  3.15   \n",
       "2     is sore and wants the knot of muscles at the b...  2.65  3.00  3.15   \n",
       "3            likes how the day sounds in this new song.  2.65  3.00  3.15   \n",
       "4                                           is home. <3  2.65  3.00  3.15   \n",
       "...                                                 ...   ...   ...   ...   \n",
       "9912                       little things give you away.  2.15  2.15  4.10   \n",
       "9913                        is wishing it was Saturday.  4.05  3.35  3.80   \n",
       "9914                    is studying hard for the G.R.E.  4.05  3.35  3.80   \n",
       "9915                              snipers get more head  1.40  4.05  3.30   \n",
       "9916  Last night was amazing! Not only did I see *PR...  4.25  3.00  3.25   \n",
       "\n",
       "      sCON  sOPN cEXT cNEU cAGR cCON cOPN  \n",
       "0     3.25  4.40    n    y    n    n    y  \n",
       "1     3.25  4.40    n    y    n    n    y  \n",
       "2     3.25  4.40    n    y    n    n    y  \n",
       "3     3.25  4.40    n    y    n    n    y  \n",
       "4     3.25  4.40    n    y    n    n    y  \n",
       "...    ...   ...  ...  ...  ...  ...  ...  \n",
       "9912  2.90  4.60    n    n    y    n    y  \n",
       "9913  3.95  4.50    y    y    y    y    y  \n",
       "9914  3.95  4.50    y    y    y    y    y  \n",
       "9915  3.40  3.95    n    y    n    n    y  \n",
       "9916  3.50  4.00    y    y    n    y    y  \n",
       "\n",
       "[9917 rows x 11 columns]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df = pd.read_csv(\"../Datasets/Personality Traits/Text to Personality Trait/MyPersonality.csv\", encoding='ISO-8859-1')\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>TEXT</th>\n",
       "      <th>cEXT</th>\n",
       "      <th>cNEU</th>\n",
       "      <th>cAGR</th>\n",
       "      <th>cCON</th>\n",
       "      <th>cOPN</th>\n",
       "      <th>split</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>I just got back from your class, so I decided ...</td>\n",
       "      <td>n</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>It is 9:35 and I am beginning my stream of con...</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Not only was the server down but it has taken ...</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>I am not exactly sure how this is supposed to ...</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>n</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Well, here I am on Friday, September something...</td>\n",
       "      <td>n</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>n</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2462</th>\n",
       "      <td>I'm super tired but I don't think i'll be...</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>n</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2463</th>\n",
       "      <td>I am excited about being a columnist, not...</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2464</th>\n",
       "      <td>Well currently I am stressed out. It is as if ...</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2465</th>\n",
       "      <td>sick nose running I feel like shit I think bei...</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2466</th>\n",
       "      <td>right now, I am in a really good mood, I don't...</td>\n",
       "      <td>y</td>\n",
       "      <td>n</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "      <td>y</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>2467 rows × 7 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                   TEXT cEXT cNEU cAGR cCON  \\\n",
       "0     I just got back from your class, so I decided ...    n    n    y    y   \n",
       "1     It is 9:35 and I am beginning my stream of con...    y    n    y    n   \n",
       "2     Not only was the server down but it has taken ...    y    n    y    y   \n",
       "3     I am not exactly sure how this is supposed to ...    y    n    y    n   \n",
       "4     Well, here I am on Friday, September something...    n    n    y    n   \n",
       "...                                                 ...  ...  ...  ...  ...   \n",
       "2462       I'm super tired but I don't think i'll be...    y    n    y    n   \n",
       "2463       I am excited about being a columnist, not...    y    n    y    n   \n",
       "2464  Well currently I am stressed out. It is as if ...    y    y    n    y   \n",
       "2465  sick nose running I feel like shit I think bei...    n    y    n    n   \n",
       "2466  right now, I am in a really good mood, I don't...    y    n    y    y   \n",
       "\n",
       "     cOPN  split  \n",
       "0       n      2  \n",
       "1       y      3  \n",
       "2       y      3  \n",
       "3       n      0  \n",
       "4       n      9  \n",
       "...   ...    ...  \n",
       "2462    n      2  \n",
       "2463    y      0  \n",
       "2464    y      7  \n",
       "2465    y      9  \n",
       "2466    y      7  \n",
       "\n",
       "[2467 rows x 7 columns]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df = pd.read_csv(\"../Datasets/Personality Traits/Text to Personality Trait/essays.csv\", encoding='ISO-8859-1')\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>type</th>\n",
       "      <th>posts</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>INFJ</td>\n",
       "      <td>'http://www.youtube.com/watch?v=qsXHcwe3krw|||...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ENTP</td>\n",
       "      <td>'I'm finding the lack of me in these posts ver...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>INTP</td>\n",
       "      <td>'Good one  _____   https://www.youtube.com/wat...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>INTJ</td>\n",
       "      <td>'Dear INTP,   I enjoyed our conversation the o...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ENTJ</td>\n",
       "      <td>'You're fired.|||That's another silly misconce...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8670</th>\n",
       "      <td>ISFP</td>\n",
       "      <td>'https://www.youtube.com/watch?v=t8edHB_h908||...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8671</th>\n",
       "      <td>ENFP</td>\n",
       "      <td>'So...if this thread already exists someplace ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8672</th>\n",
       "      <td>INTP</td>\n",
       "      <td>'So many questions when i do these things.  I ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8673</th>\n",
       "      <td>INFP</td>\n",
       "      <td>'I am very conflicted right now when it comes ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8674</th>\n",
       "      <td>INFP</td>\n",
       "      <td>'It has been too long since I have been on per...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>8675 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      type                                              posts\n",
       "0     INFJ  'http://www.youtube.com/watch?v=qsXHcwe3krw|||...\n",
       "1     ENTP  'I'm finding the lack of me in these posts ver...\n",
       "2     INTP  'Good one  _____   https://www.youtube.com/wat...\n",
       "3     INTJ  'Dear INTP,   I enjoyed our conversation the o...\n",
       "4     ENTJ  'You're fired.|||That's another silly misconce...\n",
       "...    ...                                                ...\n",
       "8670  ISFP  'https://www.youtube.com/watch?v=t8edHB_h908||...\n",
       "8671  ENFP  'So...if this thread already exists someplace ...\n",
       "8672  INTP  'So many questions when i do these things.  I ...\n",
       "8673  INFP  'I am very conflicted right now when it comes ...\n",
       "8674  INFP  'It has been too long since I have been on per...\n",
       "\n",
       "[8675 rows x 2 columns]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df = pd.read_csv(\"../Datasets/Personality Traits/Text to Personality Trait/Text_to_MBTI.csv\", encoding='ISO-8859-1')\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>text</th>\n",
       "      <th>mbti</th>\n",
       "      <th>sentiment</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>intj moment play experience life repeat today may perc experience immerse last thing post next day rest peace hear natural relationship perfection...</td>\n",
       "      <td>INFJ</td>\n",
       "      <td>POSITIVE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>find lack post alarm sex boring position often example girlfriend currently environment creatively use cowgirl missionary enough give new meaning ...</td>\n",
       "      <td>ENTP</td>\n",
       "      <td>POSITIVE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>good course say know absolutely positive good friend could amazing couple count could madly love case reconcile feeling call current topic obsessi...</td>\n",
       "      <td>INTP</td>\n",
       "      <td>POSITIVE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>dear rule arbitrary construct create dear entj sub long time see sincerely alpha none type hurt deep existential way want part probably depend ind...</td>\n",
       "      <td>INTJ</td>\n",
       "      <td>POSITIVE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>silly misconception approach logically go key unlocking think want approach guy really want go long ass vacation guy listen get even approach logi...</td>\n",
       "      <td>ENTJ</td>\n",
       "      <td>POSITIVE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8669</th>\n",
       "      <td>always think reason website become learn much shit love winger lack political consciousness doubt real hope hell twilight vampire would agree like...</td>\n",
       "      <td>ISFP</td>\n",
       "      <td>POSITIVE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8670</th>\n",
       "      <td>already exist someplace else delete ooop guess look hard start movie watch thread come know enfp thread pucca go list film enfps rather believe wo...</td>\n",
       "      <td>ENFP</td>\n",
       "      <td>POSITIVE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8671</th>\n",
       "      <td>many question thing would take purple pill pick number want work brewery couple year know familiar local craft name favorite local go summon great...</td>\n",
       "      <td>INTP</td>\n",
       "      <td>POSITIVE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8672</th>\n",
       "      <td>conflicted right come want child honestly maternal_instinct whatsoever recently none close friend child guess close friend isfj esfp esfj know cor...</td>\n",
       "      <td>INFP</td>\n",
       "      <td>POSITIVE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8673</th>\n",
       "      <td>seem change bit must say good back somewhere usually turn doctor world chase large shadowy creature else feel save else dream end reach safety hap...</td>\n",
       "      <td>INFP</td>\n",
       "      <td>POSITIVE</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>8674 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                                                                                                                       text  \\\n",
       "0     intj moment play experience life repeat today may perc experience immerse last thing post next day rest peace hear natural relationship perfection...   \n",
       "1     find lack post alarm sex boring position often example girlfriend currently environment creatively use cowgirl missionary enough give new meaning ...   \n",
       "2     good course say know absolutely positive good friend could amazing couple count could madly love case reconcile feeling call current topic obsessi...   \n",
       "3     dear rule arbitrary construct create dear entj sub long time see sincerely alpha none type hurt deep existential way want part probably depend ind...   \n",
       "4     silly misconception approach logically go key unlocking think want approach guy really want go long ass vacation guy listen get even approach logi...   \n",
       "...                                                                                                                                                     ...   \n",
       "8669  always think reason website become learn much shit love winger lack political consciousness doubt real hope hell twilight vampire would agree like...   \n",
       "8670  already exist someplace else delete ooop guess look hard start movie watch thread come know enfp thread pucca go list film enfps rather believe wo...   \n",
       "8671  many question thing would take purple pill pick number want work brewery couple year know familiar local craft name favorite local go summon great...   \n",
       "8672  conflicted right come want child honestly maternal_instinct whatsoever recently none close friend child guess close friend isfj esfp esfj know cor...   \n",
       "8673  seem change bit must say good back somewhere usually turn doctor world chase large shadowy creature else feel save else dream end reach safety hap...   \n",
       "\n",
       "      mbti sentiment  \n",
       "0     INFJ  POSITIVE  \n",
       "1     ENTP  POSITIVE  \n",
       "2     INTP  POSITIVE  \n",
       "3     INTJ  POSITIVE  \n",
       "4     ENTJ  POSITIVE  \n",
       "...    ...       ...  \n",
       "8669  ISFP  POSITIVE  \n",
       "8670  ENFP  POSITIVE  \n",
       "8671  INTP  POSITIVE  \n",
       "8672  INFP  POSITIVE  \n",
       "8673  INFP  POSITIVE  \n",
       "\n",
       "[8674 rows x 3 columns]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df = pd.read_csv(\"../Datasets/Personality Traits/Text to Personality Trait/Text_to_MBTI_with_Sentiment.csv\", encoding='ISO-8859-1')\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Text tp Cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['Complex Retrieval Queries' 'Pathfinding Queries'\n",
      " 'Simple Retrieval Queries' 'Simple Aggregation Queries'\n",
      " 'Complex Aggregation Queries' 'Verbose query'] \n",
      "\n",
      "List the first 5 organizations that have a CEO with a summary mentioning 'Leader'. \n",
      "\n",
      "Simple Retrieval Queries \n",
      "\n",
      "MATCH (o:Organization)-[:HAS_CEO]->(p:Person)\n",
      "WHERE p.summary CONTAINS 'Leader'\n",
      "RETURN o\n",
      "LIMIT 5\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>question</th>\n",
       "      <th>cypher</th>\n",
       "      <th>type</th>\n",
       "      <th>database</th>\n",
       "      <th>syntax_error</th>\n",
       "      <th>timeout</th>\n",
       "      <th>returns_results</th>\n",
       "      <th>false_schema</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Who are the top 5 users with the most interact...</td>\n",
       "      <td>MATCH (u:User)-[r:INTERACTED]-&gt;(:User)\\nWHERE ...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>bluesky</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>List the top 5 users having the most interacti...</td>\n",
       "      <td>MATCH (u:User)-[r:INTERACTED]-&gt;(:User)\\nWHERE ...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>bluesky</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Which 3 users have the largest size and a colo...</td>\n",
       "      <td>MATCH (u:User)\\nWHERE u.color = '#3CB371' AND ...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>bluesky</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Show the top 5 users who have interacted with ...</td>\n",
       "      <td>MATCH (u:User)-[:INTERACTED]-&gt;(v:User {color: ...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>bluesky</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Find the top 3 users interacted with by 'sarah...</td>\n",
       "      <td>MATCH (u:User {label: 'sarahp.bsky.social'})-[...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>bluesky</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9841</th>\n",
       "      <td>List the top 5 most active users based on tota...</td>\n",
       "      <td>MATCH (u:User)\\nWITH u, \\n     count{(u)-[:FOL...</td>\n",
       "      <td>Complex Aggregation Queries</td>\n",
       "      <td>twitter</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9842</th>\n",
       "      <td>Which three users have posted the most about '...</td>\n",
       "      <td>MATCH (u:User)-[:POSTS]-&gt;(t:Tweet)-[:TAGS]-&gt;(h...</td>\n",
       "      <td>Complex Aggregation Queries</td>\n",
       "      <td>twitter</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9843</th>\n",
       "      <td>What are the names of the top 3 hashtags used ...</td>\n",
       "      <td>MATCH (t:Tweet)-[:TAGS]-&gt;(h:Hashtag)\\nWHERE t....</td>\n",
       "      <td>Complex Aggregation Queries</td>\n",
       "      <td>twitter</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9844</th>\n",
       "      <td>Who are the top 3 users that have interacted t...</td>\n",
       "      <td>MATCH (u:User)-[:INTERACTS_WITH]-&gt;(n:User {nam...</td>\n",
       "      <td>Complex Aggregation Queries</td>\n",
       "      <td>twitter</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9845</th>\n",
       "      <td>What are the first 3 sources used in tweets th...</td>\n",
       "      <td>MATCH (u:User {name: 'Neo4j'})-[:POSTS]-&gt;(t:Tw...</td>\n",
       "      <td>Verbose query</td>\n",
       "      <td>twitter</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>9846 rows × 8 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                               question  \\\n",
       "0     Who are the top 5 users with the most interact...   \n",
       "1     List the top 5 users having the most interacti...   \n",
       "2     Which 3 users have the largest size and a colo...   \n",
       "3     Show the top 5 users who have interacted with ...   \n",
       "4     Find the top 3 users interacted with by 'sarah...   \n",
       "...                                                 ...   \n",
       "9841  List the top 5 most active users based on tota...   \n",
       "9842  Which three users have posted the most about '...   \n",
       "9843  What are the names of the top 3 hashtags used ...   \n",
       "9844  Who are the top 3 users that have interacted t...   \n",
       "9845  What are the first 3 sources used in tweets th...   \n",
       "\n",
       "                                                 cypher  \\\n",
       "0     MATCH (u:User)-[r:INTERACTED]->(:User)\\nWHERE ...   \n",
       "1     MATCH (u:User)-[r:INTERACTED]->(:User)\\nWHERE ...   \n",
       "2     MATCH (u:User)\\nWHERE u.color = '#3CB371' AND ...   \n",
       "3     MATCH (u:User)-[:INTERACTED]->(v:User {color: ...   \n",
       "4     MATCH (u:User {label: 'sarahp.bsky.social'})-[...   \n",
       "...                                                 ...   \n",
       "9841  MATCH (u:User)\\nWITH u, \\n     count{(u)-[:FOL...   \n",
       "9842  MATCH (u:User)-[:POSTS]->(t:Tweet)-[:TAGS]->(h...   \n",
       "9843  MATCH (t:Tweet)-[:TAGS]->(h:Hashtag)\\nWHERE t....   \n",
       "9844  MATCH (u:User)-[:INTERACTS_WITH]->(n:User {nam...   \n",
       "9845  MATCH (u:User {name: 'Neo4j'})-[:POSTS]->(t:Tw...   \n",
       "\n",
       "                             type database  syntax_error  timeout  \\\n",
       "0       Complex Retrieval Queries  bluesky         False    False   \n",
       "1       Complex Retrieval Queries  bluesky         False    False   \n",
       "2       Complex Retrieval Queries  bluesky         False    False   \n",
       "3       Complex Retrieval Queries  bluesky         False    False   \n",
       "4       Complex Retrieval Queries  bluesky         False    False   \n",
       "...                           ...      ...           ...      ...   \n",
       "9841  Complex Aggregation Queries  twitter         False    False   \n",
       "9842  Complex Aggregation Queries  twitter         False    False   \n",
       "9843  Complex Aggregation Queries  twitter         False    False   \n",
       "9844  Complex Aggregation Queries  twitter         False    False   \n",
       "9845                Verbose query  twitter         False    False   \n",
       "\n",
       "      returns_results false_schema  \n",
       "0                True          NaN  \n",
       "1               False          NaN  \n",
       "2                True          NaN  \n",
       "3                True          NaN  \n",
       "4                True          NaN  \n",
       "...               ...          ...  \n",
       "9841             True          NaN  \n",
       "9842             True          NaN  \n",
       "9843             True          NaN  \n",
       "9844            False          NaN  \n",
       "9845             True          NaN  \n",
       "\n",
       "[9846 rows x 8 columns]"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df = pd.read_csv(\"../Datasets/Text to Cypher Datasets/text2cypher_gpt4turbo.csv\", encoding='ISO-8859-1')\n",
    "ind = 1000\n",
    "print(df['type'].unique(), \"\\n\")\n",
    "print(df['question'][ind], \"\\n\")\n",
    "print(df['type'][ind], \"\\n\")\n",
    "print(df['cypher'][ind])\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['Simple Retrieval Queries' 'Complex Retrieval Queries'\n",
      " 'Simple Aggregation Queries' 'Pathfinding Queries'\n",
      " 'Complex Aggregation Queries' 'Verbose query' 'Evaluation query'\n",
      " 'Multi-step Queries'] \n",
      "\n",
      "What is the average size of users who have interacted with users with an area greater than 5? \n",
      "\n",
      "Simple Retrieval Queries \n",
      "\n",
      "MATCH (u:User)\n",
      "WHERE u.area > 5\n",
      "MATCH (u)-[i:INTERACTED]->(other:User)\n",
      "WITH avg(other.size) AS average_size\n",
      "RETURN average_size\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>question</th>\n",
       "      <th>database</th>\n",
       "      <th>output</th>\n",
       "      <th>type</th>\n",
       "      <th>cypher</th>\n",
       "      <th>explanation</th>\n",
       "      <th>syntax_error</th>\n",
       "      <th>timeout</th>\n",
       "      <th>returns_results</th>\n",
       "      <th>no_cypher</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Which movies from France have an IMDb rating h...</td>\n",
       "      <td>recommendations</td>\n",
       "      <td>&lt;explanation&gt;\\n1. We start by finding movies w...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (m:Movie)\\nWHERE \"France\" IN m.countries...</td>\n",
       "      <td>1. We start by finding movies with \"France\" in...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>What are the titles of the top 5 highest-gross...</td>\n",
       "      <td>recommendations</td>\n",
       "      <td>&lt;explanation&gt;\\nThis Cypher query returns the t...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (m:Movie)\\nWITH m ORDER BY m.revenue DES...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>List the first 3 movies directed by Harold Lloyd.</td>\n",
       "      <td>recommendations</td>\n",
       "      <td>&lt;explanation&gt;\\n1. We need to find the director...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (d:Director {name: \"Harold Lloyd\"})\\nMAT...</td>\n",
       "      <td>1. We need to find the director named \"Harold ...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>What genres are associated with the movie \"Toy...</td>\n",
       "      <td>recommendations</td>\n",
       "      <td>&lt;explanation&gt;\\nThis query starts by finding th...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (m:Movie {title: 'Toy Story'})-[:IN_GENR...</td>\n",
       "      <td>This query starts by finding the movie with th...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>What is the average IMDb rating of movies rele...</td>\n",
       "      <td>recommendations</td>\n",
       "      <td>&lt;explanation&gt;\\n1. **Find movies released in 19...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (m:Movie {year: 1995})\\nWITH avg(m.imdbR...</td>\n",
       "      <td>1. **Find movies released in 1995:** We need t...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9640</th>\n",
       "      <td>Find the users who have retweeted tweets from ...</td>\n",
       "      <td>twitter</td>\n",
       "      <td>&lt;explanation&gt;\\n1. **Match the \"Neo4j\" user:** ...</td>\n",
       "      <td>Multi-step Queries</td>\n",
       "      <td>MATCH (neo4j:User {screen_name: 'neo4j'})\\nMAT...</td>\n",
       "      <td>1. **Match the \"Neo4j\" user:** \\n   - Start by...</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9641</th>\n",
       "      <td>List the tweets posted by \"Neo4j\" that have be...</td>\n",
       "      <td>twitter</td>\n",
       "      <td>&lt;explanation&gt;\\n1. **Find the user \"Neo4j\":**  ...</td>\n",
       "      <td>Multi-step Queries</td>\n",
       "      <td>MATCH (neo4j:User {screen_name: \"Neo4j\"})\\nMAT...</td>\n",
       "      <td>1. **Find the user \"Neo4j\":**  `MATCH (neo4j:U...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9642</th>\n",
       "      <td>What is the average number of followers for us...</td>\n",
       "      <td>twitter</td>\n",
       "      <td>&lt;explanation&gt;\\n1. **Match users who mentioned ...</td>\n",
       "      <td>Multi-step Queries</td>\n",
       "      <td>MATCH (user1:User)-[:POSTS]-&gt;(tweet1:Tweet)-[:...</td>\n",
       "      <td>1. **Match users who mentioned \"Neo4j\" in thei...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9643</th>\n",
       "      <td>Which users have a similarity score greater th...</td>\n",
       "      <td>twitter</td>\n",
       "      <td>&lt;explanation&gt;\\n1. **Start with \"Neo4j\" user:**...</td>\n",
       "      <td>Multi-step Queries</td>\n",
       "      <td>MATCH (neo4j:User {screen_name: \"neo4j\"})\\nMAT...</td>\n",
       "      <td>1. **Start with \"Neo4j\" user:** Find the user ...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9644</th>\n",
       "      <td>Find the users who follow \"Neo4j\" and have men...</td>\n",
       "      <td>twitter</td>\n",
       "      <td>&lt;explanation&gt;\\n1. **Start with \"Neo4j\" user:**...</td>\n",
       "      <td>Multi-step Queries</td>\n",
       "      <td>MATCH (neo4j:User {screen_name: \"neo4j\"})\\nMAT...</td>\n",
       "      <td>1. **Start with \"Neo4j\" user:** \\n   - Find th...</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>9645 rows × 10 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                               question         database  \\\n",
       "0     Which movies from France have an IMDb rating h...  recommendations   \n",
       "1     What are the titles of the top 5 highest-gross...  recommendations   \n",
       "2     List the first 3 movies directed by Harold Lloyd.  recommendations   \n",
       "3     What genres are associated with the movie \"Toy...  recommendations   \n",
       "4     What is the average IMDb rating of movies rele...  recommendations   \n",
       "...                                                 ...              ...   \n",
       "9640  Find the users who have retweeted tweets from ...          twitter   \n",
       "9641  List the tweets posted by \"Neo4j\" that have be...          twitter   \n",
       "9642  What is the average number of followers for us...          twitter   \n",
       "9643  Which users have a similarity score greater th...          twitter   \n",
       "9644  Find the users who follow \"Neo4j\" and have men...          twitter   \n",
       "\n",
       "                                                 output  \\\n",
       "0     <explanation>\\n1. We start by finding movies w...   \n",
       "1     <explanation>\\nThis Cypher query returns the t...   \n",
       "2     <explanation>\\n1. We need to find the director...   \n",
       "3     <explanation>\\nThis query starts by finding th...   \n",
       "4     <explanation>\\n1. **Find movies released in 19...   \n",
       "...                                                 ...   \n",
       "9640  <explanation>\\n1. **Match the \"Neo4j\" user:** ...   \n",
       "9641  <explanation>\\n1. **Find the user \"Neo4j\":**  ...   \n",
       "9642  <explanation>\\n1. **Match users who mentioned ...   \n",
       "9643  <explanation>\\n1. **Start with \"Neo4j\" user:**...   \n",
       "9644  <explanation>\\n1. **Start with \"Neo4j\" user:**...   \n",
       "\n",
       "                          type  \\\n",
       "0     Simple Retrieval Queries   \n",
       "1     Simple Retrieval Queries   \n",
       "2     Simple Retrieval Queries   \n",
       "3     Simple Retrieval Queries   \n",
       "4     Simple Retrieval Queries   \n",
       "...                        ...   \n",
       "9640        Multi-step Queries   \n",
       "9641        Multi-step Queries   \n",
       "9642        Multi-step Queries   \n",
       "9643        Multi-step Queries   \n",
       "9644        Multi-step Queries   \n",
       "\n",
       "                                                 cypher  \\\n",
       "0     MATCH (m:Movie)\\nWHERE \"France\" IN m.countries...   \n",
       "1     MATCH (m:Movie)\\nWITH m ORDER BY m.revenue DES...   \n",
       "2     MATCH (d:Director {name: \"Harold Lloyd\"})\\nMAT...   \n",
       "3     MATCH (m:Movie {title: 'Toy Story'})-[:IN_GENR...   \n",
       "4     MATCH (m:Movie {year: 1995})\\nWITH avg(m.imdbR...   \n",
       "...                                                 ...   \n",
       "9640  MATCH (neo4j:User {screen_name: 'neo4j'})\\nMAT...   \n",
       "9641  MATCH (neo4j:User {screen_name: \"Neo4j\"})\\nMAT...   \n",
       "9642  MATCH (user1:User)-[:POSTS]->(tweet1:Tweet)-[:...   \n",
       "9643  MATCH (neo4j:User {screen_name: \"neo4j\"})\\nMAT...   \n",
       "9644  MATCH (neo4j:User {screen_name: \"neo4j\"})\\nMAT...   \n",
       "\n",
       "                                            explanation  syntax_error  \\\n",
       "0     1. We start by finding movies with \"France\" in...         False   \n",
       "1                                                   NaN         False   \n",
       "2     1. We need to find the director named \"Harold ...         False   \n",
       "3     This query starts by finding the movie with th...         False   \n",
       "4     1. **Find movies released in 1995:** We need t...         False   \n",
       "...                                                 ...           ...   \n",
       "9640  1. **Match the \"Neo4j\" user:** \\n   - Start by...          True   \n",
       "9641  1. **Find the user \"Neo4j\":**  `MATCH (neo4j:U...         False   \n",
       "9642  1. **Match users who mentioned \"Neo4j\" in thei...         False   \n",
       "9643  1. **Start with \"Neo4j\" user:** Find the user ...         False   \n",
       "9644  1. **Start with \"Neo4j\" user:** \\n   - Find th...          True   \n",
       "\n",
       "      timeout  returns_results  no_cypher  \n",
       "0       False             True      False  \n",
       "1       False             True      False  \n",
       "2       False             True      False  \n",
       "3       False             True      False  \n",
       "4       False             True      False  \n",
       "...       ...              ...        ...  \n",
       "9640    False            False      False  \n",
       "9641    False            False      False  \n",
       "9642    False             True      False  \n",
       "9643    False            False      False  \n",
       "9644    False            False      False  \n",
       "\n",
       "[9645 rows x 10 columns]"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df = pd.read_csv(\"../Datasets/Text to Cypher Datasets/text2cypher_gemini.csv\", encoding='ISO-8859-1')\n",
    "ind = 1000\n",
    "print(df['type'].unique(), \"\\n\")\n",
    "print(df['question'][ind], \"\\n\")\n",
    "print(df['type'][ind], \"\\n\")\n",
    "print(df['cypher'][ind])\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['Simple Retrieval Queries' 'Complex Retrieval Queries'\n",
      " 'Simple Aggregation Queries' 'Pathfinding Queries'\n",
      " 'Complex Aggregation Queries' 'Verbose query'] \n",
      "\n",
      "Identify characters in community 759 with a pagerank above 0.4. \n",
      "\n",
      "Pathfinding Queries \n",
      "\n",
      "MATCH (c:Character)\n",
      "WHERE c.community = 759 AND c.pagerank > 0.4\n",
      "RETURN c.name, c.pagerank\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>question</th>\n",
       "      <th>cypher</th>\n",
       "      <th>type</th>\n",
       "      <th>database</th>\n",
       "      <th>syntax_error</th>\n",
       "      <th>timeout</th>\n",
       "      <th>returns_results</th>\n",
       "      <th>false_schema</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>What are the top 5 movies with a runtime great...</td>\n",
       "      <td>MATCH (m:Movie)\\nWHERE m.runtime &gt; 120\\nRETURN...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>recommendations</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>List the first 3 directors born before 1950.</td>\n",
       "      <td>MATCH (d:Director)\\nWHERE d.born &lt; date('1950-...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>recommendations</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Which 5 users have rated more than 20 movies?</td>\n",
       "      <td>MATCH (u:User)-[r:RATED]-&gt;(m:Movie)\\nWITH u, c...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>recommendations</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Identify the top 5 actors who have acted in mo...</td>\n",
       "      <td>MATCH (a:Actor)-[:ACTED_IN]-&gt;(m:Movie)\\nWITH a...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>recommendations</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>What are the top 3 genres associated with movi...</td>\n",
       "      <td>MATCH (m:Movie)-[:IN_GENRE]-&gt;(g:Genre)\\nWHERE ...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>recommendations</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4965</th>\n",
       "      <td>Identify the first 3 tweets posted by 'Me' tha...</td>\n",
       "      <td>MATCH (me:Me)-[:POSTS]-&gt;(tweet:Tweet)-[:REPLY_...</td>\n",
       "      <td>Verbose query</td>\n",
       "      <td>twitter</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4966</th>\n",
       "      <td>List the top 5 tweets by 'Me' using a specific...</td>\n",
       "      <td>MATCH (me:Me)-[:POSTS]-&gt;(tweet:Tweet)-[:USING]...</td>\n",
       "      <td>Verbose query</td>\n",
       "      <td>twitter</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4967</th>\n",
       "      <td>Which users does 'Neo4j' follow that have a lo...</td>\n",
       "      <td>MATCH (me:Me {screen_name: 'neo4j'})-[:FOLLOWS...</td>\n",
       "      <td>Verbose query</td>\n",
       "      <td>twitter</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4968</th>\n",
       "      <td>List the first 3 tweets containing a hashtag n...</td>\n",
       "      <td>MATCH (t:Tweet)-[:TAGS]-&gt;(:Hashtag {name: 'edu...</td>\n",
       "      <td>Verbose query</td>\n",
       "      <td>twitter</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4969</th>\n",
       "      <td>Who are the top 5 users that 'Neo4j' interacts...</td>\n",
       "      <td>MATCH (me:Me {screen_name: 'neo4j'})-[:INTERAC...</td>\n",
       "      <td>Verbose query</td>\n",
       "      <td>twitter</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>4970 rows × 8 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                               question  \\\n",
       "0     What are the top 5 movies with a runtime great...   \n",
       "1          List the first 3 directors born before 1950.   \n",
       "2         Which 5 users have rated more than 20 movies?   \n",
       "3     Identify the top 5 actors who have acted in mo...   \n",
       "4     What are the top 3 genres associated with movi...   \n",
       "...                                                 ...   \n",
       "4965  Identify the first 3 tweets posted by 'Me' tha...   \n",
       "4966  List the top 5 tweets by 'Me' using a specific...   \n",
       "4967  Which users does 'Neo4j' follow that have a lo...   \n",
       "4968  List the first 3 tweets containing a hashtag n...   \n",
       "4969  Who are the top 5 users that 'Neo4j' interacts...   \n",
       "\n",
       "                                                 cypher  \\\n",
       "0     MATCH (m:Movie)\\nWHERE m.runtime > 120\\nRETURN...   \n",
       "1     MATCH (d:Director)\\nWHERE d.born < date('1950-...   \n",
       "2     MATCH (u:User)-[r:RATED]->(m:Movie)\\nWITH u, c...   \n",
       "3     MATCH (a:Actor)-[:ACTED_IN]->(m:Movie)\\nWITH a...   \n",
       "4     MATCH (m:Movie)-[:IN_GENRE]->(g:Genre)\\nWHERE ...   \n",
       "...                                                 ...   \n",
       "4965  MATCH (me:Me)-[:POSTS]->(tweet:Tweet)-[:REPLY_...   \n",
       "4966  MATCH (me:Me)-[:POSTS]->(tweet:Tweet)-[:USING]...   \n",
       "4967  MATCH (me:Me {screen_name: 'neo4j'})-[:FOLLOWS...   \n",
       "4968  MATCH (t:Tweet)-[:TAGS]->(:Hashtag {name: 'edu...   \n",
       "4969  MATCH (me:Me {screen_name: 'neo4j'})-[:INTERAC...   \n",
       "\n",
       "                          type         database  syntax_error  timeout  \\\n",
       "0     Simple Retrieval Queries  recommendations         False    False   \n",
       "1     Simple Retrieval Queries  recommendations         False    False   \n",
       "2     Simple Retrieval Queries  recommendations         False    False   \n",
       "3     Simple Retrieval Queries  recommendations         False    False   \n",
       "4     Simple Retrieval Queries  recommendations         False    False   \n",
       "...                        ...              ...           ...      ...   \n",
       "4965             Verbose query          twitter         False    False   \n",
       "4966             Verbose query          twitter         False    False   \n",
       "4967             Verbose query          twitter         False    False   \n",
       "4968             Verbose query          twitter         False    False   \n",
       "4969             Verbose query          twitter         False    False   \n",
       "\n",
       "      returns_results false_schema  \n",
       "0                True          NaN  \n",
       "1                True          NaN  \n",
       "2                True          NaN  \n",
       "3                True          NaN  \n",
       "4                True          NaN  \n",
       "...               ...          ...  \n",
       "4965             True          NaN  \n",
       "4966             True          NaN  \n",
       "4967            False          NaN  \n",
       "4968             True          NaN  \n",
       "4969             True          NaN  \n",
       "\n",
       "[4970 rows x 8 columns]"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df = pd.read_csv(\"../Datasets/Text to Cypher Datasets/text2cypher_claudeopus.csv\", encoding='ISO-8859-1')\n",
    "ind = 1000\n",
    "print(df['type'].unique(), \"\\n\")\n",
    "print(df['question'][ind], \"\\n\")\n",
    "print(df['type'][ind], \"\\n\")\n",
    "print(df['cypher'][ind])\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Prompt: Convert the following question into a Cypher query using the provided graph schema! \n",
      "\n",
      "Question: Find 8 Report that are missing the report_id! \n",
      "\n",
      "Schema: Graph schema: Relevant node labels and their properties (with datatypes) are:\n",
      "Report {report_id: STRING} \n",
      "\n",
      "Cypher: MATCH (n:Report) WHERE n.report_id IS NULL RETURN n LIMIT 8 \n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Prompt</th>\n",
       "      <th>Question</th>\n",
       "      <th>Schema</th>\n",
       "      <th>Cypher</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Convert the following question into a Cypher q...</td>\n",
       "      <td>Find the total number of Article in the graph!</td>\n",
       "      <td>Graph schema: Relevant node labels and their p...</td>\n",
       "      <td>MATCH (n:Article) RETURN count(n)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Convert the following question into a Cypher q...</td>\n",
       "      <td>Find the total number of Keyword in the graph!</td>\n",
       "      <td>Graph schema: Relevant node labels and their p...</td>\n",
       "      <td>MATCH (n:Keyword) RETURN count(n)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Convert the following question into a Cypher q...</td>\n",
       "      <td>Find the total number of Topic in the graph!</td>\n",
       "      <td>Graph schema: Relevant node labels and their p...</td>\n",
       "      <td>MATCH (n:Topic) RETURN count(n)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Convert the following question into a Cypher q...</td>\n",
       "      <td>Find the total number of Author in the graph!</td>\n",
       "      <td>Graph schema: Relevant node labels and their p...</td>\n",
       "      <td>MATCH (n:Author) RETURN count(n)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Convert the following question into a Cypher q...</td>\n",
       "      <td>Find the total number of Categories in the graph!</td>\n",
       "      <td>Graph schema: Relevant node labels and their p...</td>\n",
       "      <td>MATCH (n:Categories) RETURN count(n)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30111</th>\n",
       "      <td>Convert the following question into a Cypher q...</td>\n",
       "      <td>Search for the name in Journal that is linked ...</td>\n",
       "      <td>Relevant node labels and their properties (wit...</td>\n",
       "      <td>MATCH (n:Article) -[pu:PUBLISHED_IN {pages : '...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30112</th>\n",
       "      <td>Convert the following question into a Cypher q...</td>\n",
       "      <td>Search for the journal_id in Journal that is l...</td>\n",
       "      <td>Relevant node labels and their properties (wit...</td>\n",
       "      <td>MATCH (n:Article) -[pu:PUBLISHED_IN {year : '2...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30113</th>\n",
       "      <td>Convert the following question into a Cypher q...</td>\n",
       "      <td>Search for the name in Journal that is linked ...</td>\n",
       "      <td>Relevant node labels and their properties (wit...</td>\n",
       "      <td>MATCH (n:Article) -[pu:PUBLISHED_IN {year : '2...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30114</th>\n",
       "      <td>Convert the following question into a Cypher q...</td>\n",
       "      <td>Search for the journal_id in Journal that is l...</td>\n",
       "      <td>Relevant node labels and their properties (wit...</td>\n",
       "      <td>MATCH (n:Article) -[pu:PUBLISHED_IN {meta : '2...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30115</th>\n",
       "      <td>Convert the following question into a Cypher q...</td>\n",
       "      <td>Search for the name in Journal that is linked ...</td>\n",
       "      <td>Relevant node labels and their properties (wit...</td>\n",
       "      <td>MATCH (n:Article) -[pu:PUBLISHED_IN {meta : '2...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>30116 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                  Prompt  \\\n",
       "0      Convert the following question into a Cypher q...   \n",
       "1      Convert the following question into a Cypher q...   \n",
       "2      Convert the following question into a Cypher q...   \n",
       "3      Convert the following question into a Cypher q...   \n",
       "4      Convert the following question into a Cypher q...   \n",
       "...                                                  ...   \n",
       "30111  Convert the following question into a Cypher q...   \n",
       "30112  Convert the following question into a Cypher q...   \n",
       "30113  Convert the following question into a Cypher q...   \n",
       "30114  Convert the following question into a Cypher q...   \n",
       "30115  Convert the following question into a Cypher q...   \n",
       "\n",
       "                                                Question  \\\n",
       "0         Find the total number of Article in the graph!   \n",
       "1         Find the total number of Keyword in the graph!   \n",
       "2           Find the total number of Topic in the graph!   \n",
       "3          Find the total number of Author in the graph!   \n",
       "4      Find the total number of Categories in the graph!   \n",
       "...                                                  ...   \n",
       "30111  Search for the name in Journal that is linked ...   \n",
       "30112  Search for the journal_id in Journal that is l...   \n",
       "30113  Search for the name in Journal that is linked ...   \n",
       "30114  Search for the journal_id in Journal that is l...   \n",
       "30115  Search for the name in Journal that is linked ...   \n",
       "\n",
       "                                                  Schema  \\\n",
       "0      Graph schema: Relevant node labels and their p...   \n",
       "1      Graph schema: Relevant node labels and their p...   \n",
       "2      Graph schema: Relevant node labels and their p...   \n",
       "3      Graph schema: Relevant node labels and their p...   \n",
       "4      Graph schema: Relevant node labels and their p...   \n",
       "...                                                  ...   \n",
       "30111  Relevant node labels and their properties (wit...   \n",
       "30112  Relevant node labels and their properties (wit...   \n",
       "30113  Relevant node labels and their properties (wit...   \n",
       "30114  Relevant node labels and their properties (wit...   \n",
       "30115  Relevant node labels and their properties (wit...   \n",
       "\n",
       "                                                  Cypher  \n",
       "0                      MATCH (n:Article) RETURN count(n)  \n",
       "1                      MATCH (n:Keyword) RETURN count(n)  \n",
       "2                        MATCH (n:Topic) RETURN count(n)  \n",
       "3                       MATCH (n:Author) RETURN count(n)  \n",
       "4                   MATCH (n:Categories) RETURN count(n)  \n",
       "...                                                  ...  \n",
       "30111  MATCH (n:Article) -[pu:PUBLISHED_IN {pages : '...  \n",
       "30112  MATCH (n:Article) -[pu:PUBLISHED_IN {year : '2...  \n",
       "30113  MATCH (n:Article) -[pu:PUBLISHED_IN {year : '2...  \n",
       "30114  MATCH (n:Article) -[pu:PUBLISHED_IN {meta : '2...  \n",
       "30115  MATCH (n:Article) -[pu:PUBLISHED_IN {meta : '2...  \n",
       "\n",
       "[30116 rows x 4 columns]"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df = pd.read_json(\"../Datasets/Text to Cypher Datasets/Text_to_Cypher_Dataset.json\")\n",
    "ind = 1000\n",
    "print(f\"Prompt: {df['Prompt'][ind]} \\n\")\n",
    "print(f\"Question: {df['Question'][ind]} \\n\")\n",
    "print(f\"Schema: {df['Schema'][ind]} \\n\")\n",
    "print(f\"Cypher: {df['Cypher'][ind]} \\n\")\n",
    "\n",
    "df"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
